# Project 3, Part 3 - MySQL Database 
* Jacob Wang
* 1/11/2023
* Coding Dojo Data Science Project 3

In [1]:
import json
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

import pymysql
from sqlalchemy import create_engine
from sqlalchemy_utils import create_database, database_exists
pymysql.install_as_MySQLdb()

In [2]:
basics = pd.read_csv('Data/title_basics.csv.gz')
basics.info()
basics.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 80219 entries, 0 to 80218
Data columns (total 9 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   tconst          80219 non-null  object
 1   titleType       80219 non-null  object
 2   primaryTitle    80219 non-null  object
 3   originalTitle   80219 non-null  object
 4   isAdult         80219 non-null  int64
 5   startYear       80219 non-null  int64
 6   endYear         0 non-null      float64
 7   runtimeMinutes  80219 non-null  int64
 8   genres          80219 non-null  object
dtypes: float64(1), int64(3), object(5)
memory usage: 5.5+ MB

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance"
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El Tango del Viudo y Su Espejo Deformante,0,2020,NaN,70,Drama
2,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018,NaN,122,Drama
3,tt0088751,movie,The Naked Monster,The Naked Monster,0,2005,NaN,100,"Comedy,Horror,Sci-Fi"
4,tt0096056,movie,Crime and Punishment,Crime and Punishment,0,2002,NaN,126,Drama

In [3]:
## create a col with a list of genres
basics['genres_split'] = basics['genres'].str.split(',')
basics

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres,genres_split
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance","[Comedy, Fantasy, Romance]"
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El Tango del Viudo y Su Espejo Deformante,0,2020,NaN,70,Drama,[Drama]
2,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018,NaN,122,Drama,[Drama]
3,tt0088751,movie,The Naked Monster,The Naked Monster,0,2005,NaN,100,"Comedy,Horror,Sci-Fi","[Comedy, Horror, Sci-Fi]"
4,tt0096056,movie,Crime and Punishment,Crime and Punishment,0,2002,NaN,126,Drama,[Drama]
...,...,...,...,...,...,...,...,...,...,...
80214,tt9914942,movie,Life Without Sara Amat,La vida sense la Sara Amat,0,2019,NaN,74,Drama,[Drama]
80215,tt9915872,movie,The Last White Witch,My Girlfriend is a Wizard,0,2019,NaN,97,"Comedy,Drama,Fantasy","[Comedy, Drama, Fantasy]"
80216,tt9916170,movie,The Rehearsal,O Ensaio,0,2019,NaN,51,Drama,[Drama]
80217,tt9916190,movie,Safeguard,Safeguard,0,2020,NaN,95,"Action,Adventure,Thriller","[Action, Adventure, Thriller]"
80218,tt9916362,movie,Coven,Akelarre,0,2020,NaN,92,"Drama,History","[Drama, History]"

In [4]:
# separate the list of genres into new rows
exploded_genres = basics.explode('genres_split')
exploded_genres

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres,genres_split
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance",Comedy
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance",Fantasy
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance",Romance
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El Tango del Viudo y Su Espejo Deformante,0,2020,NaN,70,Drama,Drama
2,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018,NaN,122,Drama,Drama
...,...,...,...,...,...,...,...,...,...,...
80217,tt9916190,movie,Safeguard,Safeguard,0,2020,NaN,95,"Action,Adventure,Thriller",Action
80217,tt9916190,movie,Safeguard,Safeguard,0,2020,NaN,95,"Action,Adventure,Thriller",Adventure
80217,tt9916190,movie,Safeguard,Safeguard,0,2020,NaN,95,"Action,Adventure,Thriller",Thriller
80218,tt9916362,movie,Coven,Akelarre,0,2020,NaN,92,"Drama,History",Drama
80218,tt9916362,movie,Coven,Akelarre,0,2020,NaN,92,"Drama,History",History

In [5]:
# get unique genres
unique_genres = sorted(exploded_genres['genres_split'].unique())

## Create title_genres table

In [6]:
title_genres = exploded_genres[['tconst', 'genres_split']].copy()
title_genres.head()

      tconst genres_split
0  tt0035423       Comedy
0  tt0035423      Fantasy
0  tt0035423      Romance
1  tt0062336        Drama
2  tt0069049        Drama

## Create a genre mapper dictionary to replace string genres with integers

In [7]:
## Making the genre mapper dictionary
genre_ints = range(len(unique_genres))
genre_map = dict(zip(unique_genres, genre_ints))
genre_map

{'Action': 0,
 'Adult': 1,
 'Adventure': 2,
 'Animation': 3,
 'Biography': 4,
 'Comedy': 5,
 'Crime': 6,
 'Drama': 7,
 'Family': 8,
 'Fantasy': 9,
 'Game-Show': 10,
 'History': 11,
 'Horror': 12,
 'Music': 13,
 'Musical': 14,
 'Mystery': 15,
 'News': 16,
 'Reality-TV': 17,
 'Romance': 18,
 'Sci-Fi': 19,
 'Short': 20,
 'Sport': 21,
 'Talk-Show': 22,
 'Thriller': 23,
 'War': 24,
 'Western': 25}

In [8]:
## Make dictionary with list of unique genres as key, new int id as values
genre_id_map = dict(zip(unique_genres, range(len(unique_genres))))
genre_id_map

{'Action': 0,
 'Adult': 1,
 'Adventure': 2,
 'Animation': 3,
 'Biography': 4,
 'Comedy': 5,
 'Crime': 6,
 'Drama': 7,
 'Family': 8,
 'Fantasy': 9,
 'Game-Show': 10,
 'History': 11,
 'Horror': 12,
 'Music': 13,
 'Musical': 14,
 'Mystery': 15,
 'News': 16,
 'Reality-TV': 17,
 'Romance': 18,
 'Sci-Fi': 19,
 'Short': 20,
 'Sport': 21,
 'Talk-Show': 22,
 'Thriller': 23,
 'War': 24,
 'Western': 25}

## Replace the string genres in title_genres with the new integer ids

In [9]:
## make new integer genre_id and drop string genres
title_genres['genre_id'] = title_genres['genres_split'].map(genre_map)
title_genres = title_genres.drop(columns = 'genres_split')
title_genres.head()

      tconst  genre_id
0  tt0035423         5
0  tt0035423         9
0  tt0035423        18
1  tt0062336         7
2  tt0069049         7

## Convert the genre map dictionary into a dataframe

In [10]:
# manually make df with named cols from .keys and .values
genre_lookup = pd.DataFrame({'genre_name': genre_map.keys(),
                            'genre_id': genre_map.values()})
genre_lookup.head()

  genre_name  genre_id
0     Action         0
1      Adult         1
2  Adventure         2
3  Animation         3
4  Biography         4

# Save MySQL tables with tconst as the primary key

In [11]:
basics.dtypes

tconst             object
titleType          object
primaryTitle       object
originalTitle      object
isAdult             int64
startYear           int64
endYear           float64
runtimeMinutes      int64
genres             object
genres_split       object
dtype: object

In [12]:
## create connection
with open('/Users/jacobwang/.secret/mysql.json') as f:
    login = json.load(f)
login.keys()

dict_keys(['username', 'password'])

In [13]:
connection = f"mysql+pymysql://{login['username']}:{login['password']}@localhost/movies"
engine = create_engine(connection)

In [14]:
# Check if the database exists. If not, create it.
if database_exists(connection) == False:
  create_database(connection)
else:
  print('The database already exists')

The database already exists

In [15]:
basics.head()

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres,genres_split
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance","[Comedy, Fantasy, Romance]"
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El Tango del Viudo y Su Espejo Deformante,0,2020,NaN,70,Drama,[Drama]
2,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018,NaN,122,Drama,[Drama]
3,tt0088751,movie,The Naked Monster,The Naked Monster,0,2005,NaN,100,"Comedy,Horror,Sci-Fi","[Comedy, Horror, Sci-Fi]"
4,tt0096056,movie,Crime and Punishment,Crime and Punishment,0,2002,NaN,126,Drama,[Drama]

In [16]:

basics = basics.drop(columns = ['originalTitle', 'isAdult', 'titleType', 'genres','genres_split'])

In [17]:
## Example
from sqlalchemy.types import *
## Calculate max string lengths for object columns
key_len = basics['tconst'].fillna('').map(len).max()
title_len = basics['primaryTitle'].fillna('').map(len).max()
## Create a schema dictonary using Sqlalchemy datatype objects
df_schema = {
    "tconst": String(key_len+1), 
    "primaryTitle": Text(title_len+1),
    'startYear':Float(),
    'endYear':Float(),
    'runtimeMinutes':Integer()}

In [18]:
# Save to sql with dtype and index=False
basics.to_sql('title_basics',engine,dtype=df_schema,if_exists='replace',index=False)

80219

In [19]:
engine.execute('ALTER TABLE title_basics ADD PRIMARY KEY (`tconst`);')

In [20]:
title_genres.to_sql('title_genres',engine, if_exists='replace',index=False)

150248

In [21]:
genre_lookup.to_sql('genre_lookup',engine, if_exists='replace',index=False)

26

In [22]:
engine.execute('ALTER TABLE genre_lookup ADD PRIMARY KEY (`genre_id`);')

In [23]:
# run queries to test database
q = """
SELECT * FROM title_basics
LIMIT 5;"""
pd.read_sql(q, engine)

,tconst,primaryTitle,startYear,endYear,runtimeMinutes
0,tt0035423,Kate & Leopold,2001.0,None,118
1,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020.0,None,70
2,tt0069049,The Other Side of the Wind,2018.0,None,122
3,tt0088751,The Naked Monster,2005.0,None,100
4,tt0096056,Crime and Punishment,2002.0,None,126

In [24]:
# run queries to test database
q = """
SELECT * FROM title_genres
LIMIT 5;"""
pd.read_sql(q, engine)

      tconst  genre_id
0  tt0035423         5
1  tt0035423         9
2  tt0035423        18
3  tt0062336         7
4  tt0069049         7

In [25]:
q = """
SELECT * FROM genre_lookup
LIMIT 5;"""
pd.read_sql(q, engine)

  genre_name  genre_id
0     Action         0
1      Adult         1
2  Adventure         2
3  Animation         3
4  Biography         4

## Create 'ratings' table

In [26]:
ratings = pd.read_csv('Data/title_ratings.csv.gz')

In [27]:
ratings.info()
ratings.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 482771 entries, 0 to 482770
Data columns (total 3 columns):
 #   Column         Non-Null Count   Dtype
---  ------         --------------   -----
 0   tconst         482771 non-null  object
 1   averageRating  482771 non-null  float64
 2   numVotes       482771 non-null  int64
dtypes: float64(1), int64(1), object(1)
memory usage: 11.0+ MB

      tconst  averageRating  numVotes
0  tt0000001            5.7      1931
1  tt0000002            5.8       261
2  tt0000005            6.2      2563
3  tt0000006            5.1       176
4  tt0000007            5.4       805

In [28]:
key_len = ratings['tconst'].fillna('').map(len).max()
# create schema for ratings
ratings_schema = {
    "tconst": String(key_len+1), 
    'averageRating':Float(),
    'numVotes':Integer()}

In [29]:
ratings.to_sql('title_ratings',engine,dtype=ratings_schema,if_exists='replace',index=False)

482771

In [30]:
engine.execute('ALTER TABLE title_ratings ADD PRIMARY KEY (`tconst`);')

In [31]:
q = """
SELECT * FROM title_ratings 
LIMIT 5; """
pd.read_sql(q, engine)

      tconst  averageRating  numVotes
0  tt0000001            5.7      1931
1  tt0000002            5.8       261
2  tt0000005            6.2      2563
3  tt0000006            5.1       176
4  tt0000007            5.4       805

## Create tables for tmdb data

In [32]:
tmdb2000 = pd.read_csv('Data/final_tmdb_data_2000.csv.gz')
tmdb2001 = pd.read_csv('Data/final_tmdb_data_2001.csv.gz')
tmdb_data = pd.concat([tmdb2000, tmdb2001], axis=0)

tmdb_data.info() 
tmdb_data.head()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 4472 entries, 0 to 2268
Data columns (total 26 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   imdb_id                4472 non-null   object
 1   adult                  4470 non-null   float64
 2   backdrop_path          1968 non-null   object
 3   belongs_to_collection  248 non-null    object
 4   budget                 4470 non-null   float64
 5   genres                 4470 non-null   object
 6   homepage               231 non-null    object
 7   id                     4470 non-null   float64
 8   original_language      4470 non-null   object
 9   original_title         4470 non-null   object
 10  overview               4096 non-null   object
 11  popularity             4470 non-null   float64
 12  poster_path            3802 non-null   object
 13  production_companies   4470 non-null   object
 14  production_countries   4470 non-null   object
 15  release_date           4434 non-null   object
 16  revenue                4470 non-null   float64
 17  runtime                4470 non-null   float64
 18  spoken_languages       4470 non-null   object
 19  status                 4470 non-null   object
 20  tagline                1255 non-null   object
 21  title                  4470 non-null   object
 22  video                  4470 non-null   float64
 23  vote_average           4470 non-null   float64
 24  vote_count             4470 non-null   float64
 25  certification          821 non-null    object
dtypes: float64(9), object(17)
memory usage: 943.3+ KB

,imdb_id,adult,backdrop_path,belongs_to_collection,budget,genres,homepage,id,original_language,original_title,...,revenue,runtime,spoken_languages,status,tagline,title,video,vote_average,vote_count,certification
0,0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,tt0113026,0.0,/vMFs7nw6P0bIV1jDsQpxAieAVnH.jpg,NaN,10000000.0,"[{'id': 35, 'name': 'Comedy'}, {'id': 10402, '...",NaN,62127.0,en,The Fantasticks,...,0.0,86.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,Try to remember the first time magic happened,The Fantasticks,0.0,5.5,22.0,NaN
2,tt0113092,0.0,NaN,NaN,0.0,"[{'id': 878, 'name': 'Science Fiction'}]",NaN,110977.0,en,For the Cause,...,0.0,100.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,The ultimate showdown on a forbidden planet.,For the Cause,0.0,5.1,8.0,NaN
3,tt0116391,0.0,NaN,NaN,0.0,"[{'id': 18, 'name': 'Drama'}, {'id': 28, 'name...",NaN,442869.0,hi,Gang,...,0.0,152.0,"[{'english_name': 'Hindi', 'iso_639_1': 'hi', ...",Released,NaN,Gang,0.0,4.0,1.0,NaN
4,tt0116748,0.0,/wr0hTHwkYIRC82MwNbhOvqrw27N.jpg,NaN,0.0,"[{'id': 18, 'name': 'Drama'}, {'id': 10749, 'n...",NaN,579396.0,hi,Karobaar,...,0.0,180.0,"[{'english_name': 'Hindi', 'iso_639_1': 'hi', ...",Released,The Business of Love,Karobaar,0.0,5.5,2.0,NaN

In [33]:
# drop unnecessary columns
tmdb_data = tmdb_data[['imdb_id', 'budget', 'revenue', 'certification']]
tmdb_data

        imdb_id      budget  revenue certification
0             0         NaN      NaN           NaN
1     tt0113026  10000000.0      0.0           NaN
2     tt0113092         0.0      0.0           NaN
3     tt0116391         0.0      0.0           NaN
4     tt0116748         0.0      0.0           NaN
...         ...         ...      ...           ...
2264  tt7571842         0.0      0.0           NaN
2265  tt8929248         0.0      0.0           NaN
2266  tt8942962         0.0      0.0           NaN
2267  tt9099724         0.0      0.0           NaN
2268  tt9798698         0.0      0.0           NaN

[4472 rows x 4 columns]

In [35]:
## Calculate max string lengths for object columns
key_len = tmdb_data['imdb_id'].str.len().max()
cert_len = tmdb_data['certification'].str.len().max()
## Create a schema dictonary using Sqlalchemy datatype objects
tmdb_schema = {"imdb_id": String(key_len+1), 
    "certification": Text(cert_len+1),
    'budget':Float(),
    'revenue':Float()}

In [36]:
tmdb_data.to_sql('tmdb_data',engine, dtype=tmdb_schema, if_exists='replace',index=False)

4472

In [37]:
engine.execute('ALTER TABLE tmdb_data ADD PRIMARY KEY (`imdb_id`);')

IntegrityError: (pymysql.err.IntegrityError) (1062, "Duplicate entry '0' for key 'tmdb_data.PRIMARY'")
[SQL: ALTER TABLE tmdb_data ADD PRIMARY KEY (`imdb_id`);]
(Background on this error at: https://sqlalche.me/e/14/gkpj)

In [ ]:
q = """
SELECT * FROM tmdb_data
LIMIT 5;"""
pd.read_sql(q, engine)

## Confirm all tables have been created

In [ ]:
q = """SHOW TABLES"""
pd.read_sql(q, engine)